# M.Supraja
# 221710401038
# ECE

# Assignment(day-12:6-6-20)
# Q-1 : If you find Unnamed column in the data remove that by filtering

In [3]:
import pandas as pd
df = pd.read_csv("https://raw.githubusercontent.com/kotagiri-preeti/Summer-Internship-AI-and-ML/master/german_credit_data.csv",index_col=0,na_values=" ")
df

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car
...,...,...,...,...,...,...,...,...,...
995,31,female,1,own,little,NaN,1736,12,furniture/equipment
996,40,male,3,own,little,little,3857,30,car
997,38,male,2,own,little,NaN,804,12,radio/TV
998,23,male,2,free,little,little,1845,45,radio/TV
999,27,male,2,own,moderate,moderate,4576,45,car

# Q-2 : Display the top seven rows and last Three rows
###  top seven rows:

In [5]:
df.head(7)

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car
5,35,male,1,free,NaN,NaN,9055,36,education
6,53,male,2,own,quite rich,NaN,2835,24,furniture/equipment

### last three rows:

In [8]:
df.tail(3)

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
997,38,male,2,own,little,NaN,804,12,radio/TV
998,23,male,2,free,little,little,1845,45,radio/TV
999,27,male,2,own,moderate,moderate,4576,45,car

# Q-3 : Check the total number of entries you have

In [9]:
df.count()

Age                 1000
Sex                 1000
Job                 1000
Housing             1000
Saving accounts      817
Checking account     606
Credit amount       1000
Duration            1000
Purpose             1000
dtype: int64

# Q-4 : Check the No of features,Print features Names(Column Names)

In [10]:
x = [print(col) for col in df.columns]

Age
Sex
Job
Housing
Saving accounts
Checking account
Credit amount
Duration
Purpose

# Q-5 : Print the row indices of the dataframe

In [11]:

y = df.head()
[print(ind) for ind in y.index]

0
1
2
3
4

[None, None, None, None, None]

# Q-6 : Check the dtype of each and every columns

In [12]:
df.dtypes

Age                  int64
Sex                 object
Job                  int64
Housing             object
Saving accounts     object
Checking account    object
Credit amount        int64
Duration             int64
Purpose             object
dtype: object

# Q-7 : Description for Numerical Column min,max,count,25%,50%,75%,std

In [13]:

df.Age.describe()

count    1000.000000
mean       35.546000
std        11.375469
min        19.000000
25%        27.000000
50%        33.000000
75%        42.000000
max        75.000000
Name: Age, dtype: float64

In [14]:

# top
df.Age.head()

0    67
1    22
2    49
3    45
4    53
Name: Age, dtype: int64

In [16]:
# freq top
df['Age'].value_counts().head()

27    51
26    50
23    48
24    44
28    43
Name: Age, dtype: int64

# Q-9 : Missing value count column wise

In [17]:
df.isna().sum()

Age                   0
Sex                   0
Job                   0
Housing               0
Saving accounts     183
Checking account    394
Credit amount         0
Duration              0
Purpose               0
dtype: int64

# Q-10 : Check the output for the info function

In [18]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Age               1000 non-null   int64
 1   Sex               1000 non-null   object
 2   Job               1000 non-null   int64
 3   Housing           1000 non-null   object
 4   Saving accounts   817 non-null    object
 5   Checking account  606 non-null    object
 6   Credit amount     1000 non-null   int64
 7   Duration          1000 non-null   int64
 8   Purpose           1000 non-null   object
dtypes: int64(4), object(5)
memory usage: 58.6+ KB

# Q-11 : Access particular rows and columns using iloc,loc

In [21]:

# using loc
df.loc[1:5,:]

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment
4,53,male,2,free,little,little,4870,24,car
5,35,male,1,free,NaN,NaN,9055,36,education

In [22]:
df.loc[0:6,['Age','Sex']]

   Age     Sex
0   67    male
1   22  female
2   49    male
3   45    male
4   53    male
5   35    male
6   53    male

In [23]:
df.loc[2,:]

Age                        49
Sex                      male
Job                         1
Housing                   own
Saving accounts        little
Checking account          NaN
Credit amount            2096
Duration                   12
Purpose             education
Name: 2, dtype: object

In [24]:
# using iloc
df.iloc[0:4,0:]

,Age,Sex,Job,Housing,Saving accounts,Checking account,Credit amount,Duration,Purpose
0,67,male,2,own,NaN,little,1169,6,radio/TV
1,22,female,2,own,little,moderate,5951,48,radio/TV
2,49,male,1,own,little,NaN,2096,12,education
3,45,male,2,free,little,little,7882,42,furniture/equipment

In [25]:
df.iloc[2:5,0:2]

   Age   Sex
2   49  male
3   45  male
4   53  male

# Q-12 : How many Unique values are there in a particular column

In [29]:
df.nunique()

Age                  53
Sex                   2
Job                   4
Housing               3
Saving accounts       4
Checking account      3
Credit amount       921
Duration             33
Purpose               8
dtype: int64

In [30]:
# in a perticular column
df.Age.nunique()

53